In [31]:
import pandas as pd
from pandas import read_csv
import pickle
import numpy as np

In [17]:
fillname = 'hiring.csv'
data = read_csv(fillname)
data.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [18]:
#Cheacking missing values
data.isnull().sum()

experience         2
test_score         1
interview_score    0
salary             0
dtype: int64

In [19]:
# Handling missing value
data['experience'].fillna(0 , inplace=True)
data['test_score'].fillna(data['test_score'].mean(), inplace=True)

In [20]:
data.head()

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [21]:
# Feature Selection
X = data.iloc[: , :3]
y = data.iloc[: , -1]

In [22]:
X.head()

  experience  test_score  interview_score
0          0         8.0                9
1          0         8.0                6
2       five         6.0                7
3        two        10.0               10
4      seven         9.0                6

In [23]:
y.head()

0    50000
1    45000
2    60000
3    65000
4    70000
Name: salary, dtype: int64

In [27]:
# Data Conversion 
def data_conversion(word):
    my_dicit = {"one" : 1, "two": 2 ,"three" : 3, "four": 4 ,"five" : 5, "six": 6 ,"seven" : 7,
                "eight": 8 ,"nine" : 9, "ten": 10 ,"eleven" : 11, "twelve": 12, 0:0 }
    return my_dicit[word]

In [29]:
X["experience"]  = X["experience"].apply(lambda x :data_conversion(x))

In [30]:
X.head()

   experience  test_score  interview_score
0           0         8.0                9
1           0         8.0                6
2           5         6.0                7
3           2        10.0               10
4           7         9.0                6

In [33]:
df = pd.concat([X,y] , axis = 1 )
df.head()

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000

In [34]:
df.dtypes

experience           int64
test_score         float64
interview_score      int64
salary               int64
dtype: object

In [36]:
df.to_csv("clean_hiring.csv")

In [39]:
from sklearn.linear_model import LinearRegression
clf = LinearRegression()
clf.fit(X,y)
clf.score(X,y)

0.9639958361860578

In [40]:
#Save the model 
pickle.dump(clf, open('model.pkl', 'wb'))

In [42]:
#Load the model
model = pickle.load(open('model.pkl','rb'))
print(model.predict([[2,8,7]]))

[53574.92984302]

C:\Users\El_Gohary\anaconda3\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(